[{"Title":"A Developer's Journey from OO to Functional","Abstract":"Learning a new paradigm is one of the more difficult things to do in software development.\nSo why would an object oriented developer of 10 years suddenly decide to make the drastic switch to functional programming?\nIn this talk I'll show you why I started looking for other ways of writing software and why the switch wasn't as sudden or as drastic as it may seem.\n\nWe'll start our journey with C#, discussing SOLID principals and the use of IoC containers.\nThen we'll move to JavaScript to see first class functions and closures.\nWe'll finish up with F#, seeing DDD, type providers, discriminated unions, and a certain 5 letter M word.","Speaker":"ReidNEvans","Tags":["Functional Programming","Programming Paradigms","C#","F#"]},{"Title":"A Practical View of Release Management for Visual Studio 2015","Abstract":"This session provides a detailed technical presentation of the functionality and architecture of Release Management for Visual Studio 2015. We start by presenting an overview of the key concepts, architecture, and configuration of the various components. We discuss the out-of-the box deployment actions available to compose automations for common deployment scenarios and how to use extensibility to cover the not-so-common scenarios. In more detail, we discuss the mechanism to manage variables across environments, how to include manual intervention, automated tests and rollbacks as part of a deployment, how to trigger release as part of a build, how to leverage logs to diagnose failed releases, and finally how to add custom actions to the inventory. These are presented through specific scenarios encountered in the field. ","Speaker":"Paul Hacker","Tags":["Continuous Integration"]},{"Title":"Acceptance & Functional Testing with Codeception","Abstract":"Go beyond unit testing and use Codeception to not only unit test your application, but also test your forms, links, navigation, API calls, AJAX request handling, and more. Codeception has support for many modern frameworks, Selenium WebDriver integration, and BDD style readable tests. Codeception makes it easy to write tests to check every change of the front end and back end of your application. Codeception also does an amazing job at unit testing, it is a complete testing framework.","Speaker":"Joe Ferguson","Tags":["Intermediate","PHP","Testing"]},{"Title":"AURELIA - SIMPLE APP DEVELOPMENT ON EVERY PLATFORM","Abstract":"In this session Ashley Grant (Core Team Member) will introduce you to Aurelia, a next generation open source JavaScript framework for building apps on every platform. With its focus on clean JavaScript code, modern architecture, data binding, extensible HTML and testability, you'll wonder how you ever got along without it.","Speaker":"Ashley Grant","Tags":["Beginner","Web","JavaScript","Aurelia"]},{"Title":"Azure App Service - Building Modern Enterprise Applications in the Cloud","Abstract":"Azure App Service is a one-of-a kind solution that brings together the tools you need for building enterprise-ready apps around a common development, management and billing model. You can choose from a rich ecosystem of pre-built apps and API services as well as a unified set of enterprise capabilities including mobile backend services, turnkey connectivity to SaaS and enterprise systems, and workflow-based creation of business processes.\n\nAzure App Service frees developers to focus on delivering great business value instead of needing to worry about repetitive tasks such as stitching disparate data sources together or dealing with operational and compliance overhead. This unified approach lets you take full advantage of the service while helping you meet your company’s concerns about security, reliability, and scalability.\n\nIn this session, we will create an enterprise class web application and deploy it using Azure App Service.  Once deployed, we will explore extending our application by integrating third party services and automating business processes.\n","Speaker":"Richard Taylor","Tags":["Intermediate","Azure"]},{"Title":"Building a visual programming tool for a custom rules engine using Elixir","Abstract":"In this talk we’ll build a custom visual programming language that compiles down to Elixir modules.  The language will be focused on generating chatbots atop an XMPP server, but the concept more broadly involves building a Rules Engine that generates runtime-configurable output based on input documents.\n\nWe’ll define an Abstract Syntax Tree for a custom language, a compiler that translates that AST into Elixir modules, and a UI for building the AST directly (i.e. no parser - this is not a text-based language).  We’ll also walk through the supporting web application that handles storing the AST as it’s built.","Speaker":"jadams","Tags":["Advanced","Functional Programming","Web","Research","Elixir"]},{"Title":"Building Reactive, Realtime Apps Without Writing Javascript","Abstract":"Client-side frameworks dominate the conversation about the future of web apps. Let's explore a way to build realtime apps driven purely by a traditional backend, and how this could work into the landscape of existing frameworks. You’ll walk away with a new way to build modern, realtime apps without embracing client-side patterns.","Speaker":"Bryan Powell","Tags":["Ruby","Web"]},{"Title":"Building Software Products in a Weekend (Really!)","Abstract":"A programming language agnostic talk about methods and strategies that you can use to get a Minimum Viable Product out of the door quickly for your business or side-project. No more procrastinating or adding \"just one more feature,\" this talk will show you how to release a MVP sooner so that you can validate your product. \n\n- How to boil your idea down to a Minimum Viable Product (MVP).\n- Time-saving development tips that work for any language.\n- Valuing yourself based on your end product, not your code.\n- My 3-Step \"Find It, Buy It, Build It\" Development Process.\n- How to plan out your project so that you can really get it \"done\" in a weekend.\n\nThe audience should come armed with programming knowledge to put these techniques into practice, and should also have an idea they want to make a reality!","Speaker":"Matt Kremer","Tags":["Side Projects","MVP Development","Startups"]},{"Title":"Canopy: Easy Automated UI Testing for the Web","Abstract":"Canopy is a powerful and intuitive open source tool for writing automated tests for web applications. It uses a DSL that is easy learn. And the DSL is built on top of F# which gives you the full power of that language as well. In this session, we will look at how to get started, even if you have no F# experience. ","Speaker":"Eric Potter","Tags":["Testing","Functional Programming"]},{"Title":"Component-Based CSS Architecture","Abstract":"How easily could you update the color scheme or the typography of your site? Can you freely experiment with your site header without fear of breaking something else? Do you know exactly where to find the relevant CSS for any given piece of your interface?\n\nThese questions matter today more than ever. We are building massive, complex systems that are non-trivial to maintain. Without the right approach, even the simplest change could cause hours of regression testing and debugging.\n\nI would submit to you that the answer is a component-based architecture. And I’m not alone in that—many people much smarter than I am have suggested this very approach. From SMACSS to Atomic Design and OOCSS to BEM, we see great examples everywhere of people tackling this problem.\n\nIn this session, I’ll talk about how to organize, name, and build CSS “components” both at a macro and a micro level. I'll also highlight tools to make everything easier and show real-world examples of components in action.","Speaker":"Jeremy McDuffie","Tags":["Web","UX","Design","CSS"]},{"Title":"Continuous Delivery","Abstract":"In the last 1990s, there were a lot of people working on the web that were just starting their career in computer science. These people didn't know that you could not or should not continually update the software their users were using. So, that is what they did. Over a decade later, this practice has a name: Continuous Delivery. This talk will cover some history and the culture and methodology required to be successful in using Continuous Delivery.","Speaker":"Brian Moon","Tags":["Continuous Integration","Methodology","Agile"]},{"Title":"Converting to Agile: Answering the Common Questions","Abstract":"Moving to an Agile mentality can be challenging.  There are many processes that are not inherent to a team that has been doing Waterfall their entire career.  In this session we will be breaking down the sections of Scrum including the meetings, reports, and processes.  We will discuss what the meetings are as well as dive into why they are all important.  Why are you being asked to have code ready in 2 weeks? Why do we have to spend time every morning in a stand up? Why do I have to participate in a retrospective? What the heck is a ‘self-organizing’ team and why is it important?  What is velocity and why should I care? What do you mean the requirements changed? When do requirement changes get implemented/added to the scope? We will answer these questions and more! At the end of this session, you should have a better understanding of the meetings and processes in an Agile environment and why they are important. You can then take these answers back for when you are asked the common questions!\n","Speaker":"Heather Tooill","Tags":["Beginner","Soft Skills","Project Management","Methodology","Business Analysis","Agile"]},{"Title":"Cross-Platform Desktop Apps with Electron","Abstract":"Would you like to leverage your HTML, CSS, and JavaScript skills to build cross-platform desktop applications? Electron is an open source application shell created by GitHub, designed to make building great desktop applications easy. You may have already experienced Electron using applications such as Atom, Slack, Nuclide, or Visual Studio Code. In this talk, you will learn its features, how to quickly get started, and tips from my experience building Electron applications.","Speaker":"David Neal","Tags":["Node.js"]},{"Title":"Data Access, Selecting the Right Tools for the Problem","Abstract":"Managing data is at the core of every software development project.  As a software developer, how we programmatically manage and access data can determine the maintainability and scalability of our products.  There are many tools and techniques available that are designed to make data access easier but there is a cost to “easy”.  In this session, we will explore data access options in .NET using core framework technologies (ADO.NET, Entity Framework) and third party ORM (Object Relational Mapping) tools.  We will also examine the pros and cons of each so that we can make the “right” choice for our projects.","Speaker":"Richard Taylor","Tags":["Intermediate","Database"]},{"Title":"Data Science with Python and Friends","Abstract":"Data is everywhere!  You've heard it before because it's true.  Python is one of the best platforms for data analytics.  This talk will survey the Python frameworks and tools - including IPython, pandas and d3 - data scientists all over the world use to make sense of data that is worthless by itself by can turn into actionable information worth dollars.  And you don't have to have a Ph.D.  Python makes data science very accessible.  Since most of the tools are open source, you've got nothing to lose!  Stop ignoring the value hiding behind the logs and CSVs.","Speaker":"Douglas Starnes","Tags":["Intermediate","Python","Data Science"]},{"Title":"DevSpace: The Good, The Bad, and The Ugly","Abstract":"This session is your opportunity to give back. I will spend a few minutes talking about what it took to organize on the conference. Then, I want to go around the room and hear what everyone thought was the good, the bad, and the ugly. What worked and what did not. This is your chance to give feedback straight to the conference.","Speaker":"Chris Gardner","Tags":[]},{"Title":"Dive into the Team Foundation Server Agile Planning Tools","Abstract":"Team Foundation Server 2015 and Visual Studio Online bring a valuable set of new features and capabilities to agile teams. They provide a simple-to-use experience on top of a powerful, customizable platform. In this session we go deep into the agile planning tools and how to customize them to work the way your team does. We also touch on best practices that Microsoft has learned and applied from “dogfooding” these tools for their own use. ","Speaker":"Paul Hacker","Tags":["Project Management","Agile"]},{"Title":"Do you even Kanban?","Abstract":"Kanban is just sticky notes on a whiteboard, right? Whatever work you do, you have a process for that work. Be it software development, operations, services, recruiting, marketing, event planning, or professional cat wrangling. Kanban harnesses the power of visual information to turn your work into brain candy (or bacon). Yet, there is much more to Kanban than visualization. In this fun and entertaining talk, you will learn the core principles and practices of Kanban, and maximize its potential to evolve how you, your team, and your organization works.","Speaker":"David Neal","Tags":["Soft Skills","Project Management"]},{"Title":"Finding happiness in Turing completeness","Abstract":"We all have our favorite languages, favorite tools, and favorite ways of doing things.  We love to talk to each other about pros and cons and why certain tools are better then others. More often then not these discussions lead to nothing but misery.  Mired in a world of baseless opinion how can we be expected to make rationale decisions.  \n\nThankfully, under all of that opinion is the cold theory of Turing Completeness.\n\nIn this talk we'll take a whirlwind tour of Turing completeness in both theoretically and practically.  We'll discuss how it informs all of our favorite languages and we'll (hopefully) find happiness and contentment.","Speaker":"Keathley","Tags":["Advanced","Soft Skills","Computation Theory"]},{"Title":"From zero to Agile in 60 minutes","Abstract":"Many organizations say they are Agile, but so many are doing Agile rather than being Agile. The mechanics are there, but the heart is missing. \n\nIn this interactive session, you will learn the basics of embracing Agile as a way of life. You will focus on the important aspects of meetings, tools and learn how to avoid getting mired down into \"process over people\".","Speaker":"GBWorld","Tags":["Methodology","Agile"]},{"Title":"Game Development using Unity and Playmaker","Abstract":"This talk will cover the basics of creating a 3D game using Unity and the Playmaker plugin. Using Playmaker, a complete game can be created in the GUI interface using FSMs (finite state machines), which eliminates the need for writing code. Games created using Unity and Playmaker can be distributed on multiple platforms, such as web, Windows desktop, Mac, Linux, Android, iOS, and Playstation Vita.","Speaker":"Levi D. Smith","Tags":["GameDev","Unity"]},{"Title":"Game Development with Unity","Abstract":"Unity is a cross platform game development IDE that can target PC. Mac, Linux, Web, iOS, Android, PlayStation (PS3, PS4, Vita, and PSTV), Xbox (360 and XboxOne), and Wii U - many of these for free.  Code in Unity can be written in JavaScript or C# and uses the open source .Net implementation Mono under the hood.  You can even use Visual Studio as the code editor!\n\nThis session will be a live demonstration of Unity, and a look at some simple games made with Unity.  The format will be an instructor led discussion so come with any questions you have about Unity.  For more information about Unity or to download the free version visit unity3d.com","Speaker":"Michael C. Neel","Tags":["C#","GameDev","Unity"]},{"Title":"Git Hooks for the Front End Developer","Abstract":"Git hooks are powerful, and can really provide a smooth polish to a front end developer’s workflow. This presentation will focus specifically on the pre-commit git hook, which performs a final check of what's being committed to the repo at the time of committing. This session will feature a live demo of incorporating pre-commit into a team’s workflow. While the focus here is pre-commit, the general purpose of git hooks will also be discussed along with some additional examples of git hooks. A second live demo, this one detailing how to use NodeJS and Gulp tasks in git hooks, will also be included in this presentation. A recap and time for questions will round out the session.","Speaker":"Bradley Gore","Tags":["Node.js","JavaScript","Git","Gulp"]},{"Title":"Hacking Network Device APIs","Abstract":"This presentation is a live demonstration of how to use Packet Sender (https://packetsender.com/) plus Wireshark (https://www.wireshark.org/) to reverse engineer a black box networked device (for this demonstration, a Raspberry Pi running custom TCP and UDP servers). \n\nAfter the box's capabilities are acquired, it can then be extended by Packet Sender. During the demonstration, broader ideas with regards to network programming will be discussed. Anybody who is interested in developing network code is highly encouraged to attend.\n\nDan Nagle is the author and inventor of Packet Sender. ","Speaker":"Dan Nagle","Tags":["Advanced","C++","UDP/TCP"]},{"Title":"How to be a Six Figure Developer","Abstract":"Software and website developers are in extremely high demand and rates continue to climb, but many developers have not yet realized their potential. In this talk we lay out some simple and proven ways to measure your accomplishments, establish a personal brand, and increase your value to employers.","Speaker":"Gaines Kergosien","Tags":["Soft Skills","Networking","Career Development","Branding"]},{"Title":"If your view ain't first, you're last","Abstract":"I want to prototype web sites and apps FAST, but most templating languages come at me like a spider monkey with logic and code that should be only in the back end. But then I discovered the Shake-N-Bake that is view-first development, and now my prototyping tastes like America - full of winning. In this session, we will cover prototyping with the Pakyow web framework. So get all jacked on Mountain Dew and follow along.","Speaker":"Kyle Newman","Tags":["Beginner","Intermediate","Ruby","Web","Design"]},{"Title":"Introduction to Software Design - Establishing a SOLID Foundation","Abstract":"Are you tired of opening classes that have hundreds or thousands of lines of code? Do you feel that you spend too much time trying to understand how something (that should be simple) in your application works? Are you frustrated with following spaghetti-like logic through your code’s core?\n\nIn this presentation, we’re going to examine a set of design principles that yield easy-to-read, decoupled code referred to as SOLID. To start, we’ll explore the history of SOLID and establish the problems it solves. From there, we’ll dive into the different principles (Single Responsibility, Open/Closed, Liskov Substitution, Interface Segregation, and Dependency Inversion) by defining what each principle means, how to spot violations, and how to resolve them.\n\nIntended for developers wanting to learn more about software design, by the end of the presentation, you should be able to describe what SOLID code is. In addition, you should also be able to spot trouble areas in your codebase and have the tools to undo the damage.","Speaker":"Cameron Presley","Tags":["Beginner","Methodology","Design"]},{"Title":"Irresistible APIs: Creating Platforms with Developers in Mind","Abstract":"When creating a new REST platform, the planning process frequently gets skipped (or is misunderstood) resulting in an ill-conceived API. I’ll walk you through the steps needed to create an API that developers love, and point out the common traps to avoid.\n\nThe presentation will cover creating user stories, deciding on metrics, planning the API, design decisions, documentation and developer support. I will focus on creating a developer experience that will delight and amaze your developer partners and increase engagement with your platform. This talk will focus on higher level choices rather than HTTP architecture, and is appropriate for developers, product managers, or anyone else with an interest in achieving success for their API program.\n\nThe Open API Ecosystem is an amazing opportunity for companies to partner with developers, but you really only get one chance to impress, so come learn how to make your company’s API an “A List” destination.","Speaker":"Kirsten Hunter","Tags":["API"]},{"Title":"Is Your API Misbehaving?","Abstract":"Most API testing is a joke. We have things that resemble Unit Tests which are really integration tests which really just wrap our personal understanding in just a bit of code. And at the end of the day, we’re still not sure it works. Instead, let’s flip the entire experience around and look at it from the API consumer’s point of view and confirm that we’re solving real problems for real users. In this talk, we’ll dive into some of the benefits of Behavior Driven Development and walk through some examples.","Speaker":"Keith Casey","Tags":["Intermediate","Testing","Behavior Driven Development","API"]},{"Title":"Leading as a Grunt: Finding Leadership Opportunities Wherever You Find Yourself","Abstract":"How do you identify a leader?  Is it someone with a particular role or title?  Or is it something else; something more in the behaviors they exhibit day in and day out?  Come join the conversation, led by someone without traditional leadership role, title, or other accolade.  We’ll explore a behavioral definition of leadership centered on helping others learn and grow.  I'll share some actions and behaviors you can begin practicing, and you'll leave with techniques to grow your confidence, your competence, and your career!","Speaker":"John Strobel","Tags":["Soft Skills"]},{"Title":"Listening for better professional and personal lives","Abstract":"The ability to listen is one of top three skills employers seek in applicants and a major factor in promotions.\n\nGood listening skills are critical to long-lasting relationships.\n\nIf it's so important, why do we seem to have so many disagreements, opportunities squandered, and productivity lost because of a lack of it?\n\nIn this presentation, we will cover several ways for you to master the oft-silent and more frequently strenuous art of listening.","Speaker":"Kyle Newman","Tags":["Soft Skills"]},{"Title":"Making the Unstable Stable - An Introduction to Testing","Abstract":"Does it always seem like bugs you’ve fixed keep coming back? Does it seem like when you fix one bug, two more crop up? What if I were to tell you there’s a better way? \n\nIn this presentation, we're going to explore how to make a code base more stable by using automated testing. To start, we'll explore the business case of why you should be writing tests by comparing three different companies that had different ideas when it came to testing and what the outcomes were. From there, we’ll look at the fundamentals of testing by talking about the pros/cons of unit, integration, and UI testing. Finally, we’ll look at some resources to learn how to write tests.\n\nIntended for developers who are new to testing, by the end of this presentation, you will  understand why you should write tests, and will have the concepts and tools to get started.","Speaker":"Cameron Presley","Tags":["Beginner","Intermediate","Testing"]},{"Title":"Microservices, Silver Bullet or Hot Air","Abstract":"As software gets more and more complex, businesses look for easier ways to manage their portfolios of applications. The latest simplification effort is known as microservices. Are microservices really something new and different or a rechurning of old ideas? Will they solve your solution ills or are they just another tool for your toolbelt, or worse? This session is focused on answering those questions, and more.\n\nThis session starts with a high level view of what microservices are ends showing you how to decompose solutions into proper microservices. Along the way, you will learn the necessary basics of Domain Driven Design, Contract First Development and SOLID development principles.","Speaker":"GBWorld","Tags":[]},{"Title":"Microsoft Azure Makes Machine Learning Accessible (and affordable!)","Abstract":"I know what you're thinking:\n\n\"Hmmm .. \n Machine Learning? .. \n No .. I don't want to do math on a Saturday \"\n\nYou don't have to!  Machine learning is one of the most sought after skills in the IT industry today.  But, traditionally it has been accessible only by scientists with the knowledge to use it and big companies with the budget to afford it.  That's where the Microsoft Azure Machine Learning Studio comes in.  Azure ML is a graphical, web based, application that lets user focus on the task they want to accomplish without doing math and in many cases without writing code.  It also prevents users from having to spend a lot of money because there is a free tier as well.  If Azure ML doesn't fit your needs, it can be extended using R and Python, two of the most popular languages for data analytics.  And once you've taught Azure ML, it will generate REST web services that can be consumed by practically any client.  This talk will look at the machine learning features Microsoft Azure offers and how to use them in a variety of applications.","Speaker":"Douglas Starnes","Tags":["Intermediate","Python","Azure","Machine Learning","R"]},{"Title":"Microsoft Azure Without Microsoft","Abstract":"Microsoft Azure is a highly-scalable cloud computing platform. But what if my business is built on Linux and Oracle? What if I build iPhone or Android apps for a living? What if I’m a PHP developer or Java developer? Can Azure help me and my products and services?\nIn this presentation, I will show you Microsoft Azure services that can improve your application or infrastructure, even if you are working exclusively in Open Source or non-Microsoft technologies.","Speaker":"David Giard","Tags":[]},{"Title":"Own Your Own Career – Advice from a Veteran Consultant","Abstract":"I have witnessed or committed many mistakes during my decades of consulting. I will pack into this presentation as much advice as I can about managing your career and your customer as you traverse the wilds of consulting. I’ll start with ways to take ownership of your career and responsibility for achieving your goals; then, I will teach key lessons on working with your customer in a way that benefits you both.","Speaker":"David Giard","Tags":[]},{"Title":"Passwords Don’t Work! Using Two Factor Authentication To Secure Users","Abstract":"The Internet is a dangerous place and user passwords aren’t safe.  You have done everything right but it’s only a matter of time before your users’ secrets are exposed. How are you supposed to protect your site and your customers’ accounts? Enter Two Factor Authentication (2FA) to the rescue! 2FA adds a second easy to use but hard to break layer of security to your services. In this session you will learn the basics of Two Factor Authentication, examine the pros and cons for common methods of implementation, see several demos of 2FA in action, and discover best practices to deploy it in your own systems. \n","Speaker":"Alan P. Barber","Tags":["Security","C#","Web"]},{"Title":"Powering Development with PowerShell","Abstract":"As a developer you've likely heard of PowerShell. You likely think of it as a tool for administrators or DBAs, not for development. If so, you are missing out on a lot. PowerShell has a many uses for the developer. \n\nIn this session we'll start with a quick overview of PowerShell. Then we'll look at examples of the many ways in which PowerShell can assist with development tasks. Some examples include:\n\n-- Working with project files.\n-- Manipulating XML\n-- Reading and writing JSON\n-- Combining PowerShell with C#\n-- Interfacing with Websites\n-- And more!\n\nSo don't miss out, see how much PowerShell can help with your day to day development activities. \n","Speaker":"Robert Cain","Tags":["PowerShell"]},{"Title":"Promoting Your Game with Social Media","Abstract":"In this presentation, we will cover how to use various social media outlets to promote a game to reach your customer base.  Topics covered include Twitter, YouTube, WordPress, Yoast SEO plugin, Reddit, Social Media Cards, Google Alerts, Google Analytics, Google Webmaster Tools and more!","Speaker":"Levi D. Smith","Tags":[]},{"Title":"Prototyping Mobile Apps Quickly with Ionic Creator","Abstract":"So, you want to learn how to program cross-browser mobile apps that “just work”, right out of the box? Let’s take a quick dip into Ionic, a hybrid mobile framework that takes care of all the hard work for you.\n\nThen, we’ll build an app together using Ionic Creator, a drag & drop tool that allows you to export real, usable Ionic code. And yes, it is way better than FrontPage or DreamWeaver. Creator will allow you to prototype apps quickly, without writing any code, so you can show your mockups to your users, your boss, or your family members (they’ll be impressed, I promise).\n\nStop wasting time writing code for the same interface over and over until you “get it right.” Just drag & drop elements onto the screen, link together all your pages, and hit preview. Then, once it’s perfect, export your quality code!","Speaker":"Matt Kremer","Tags":["UX","Mobile Development","Ionic Framework","Prototyping"]},{"Title":"Quest for Fun","Abstract":"What is fun? What makes an activity exciting and enjoyable? Can fun be planned? Can you design fun the same way an architect designs a building? These are more than abstract thoughts, but but questions that kept me awake at night.  As a game designer I want to know if I'm creating something fun long before the game is in beta test and years of development were wasted.\n\nThis session represents the years of research I spent answering the question, and the questions that followed.  We will cover why people play games, expectations of the design, decoding feedback, and most importantly the preferences of the player and how they relate to our own.\n\nUltimately this is a talk about how to be a better developer through the lens of game design, so even if you are not interested in creating games you will come away enlightened!","Speaker":"Michael C. Neel","Tags":["Design","GameDev"]},{"Title":"REST Best Practices","Abstract":"When we discuss APIs, most people immediately think of OAuth, GET and POST, and JSON, few people think of the underlying concepts of nouns and verbs, idempotence, and uniform interfaces. Even less consider how we can combine these concepts into hypermedia to build APIs that are useful, logical, and future-friendly. In this session, we'll combine the basics, explore the larger concepts, and look at the standards that are leading the way.","Speaker":"Keith Casey","Tags":["Beginner","Intermediate","Business Analysis","API"]},{"Title":"Sass - Improving upon CSS","Abstract":"While new properties and selectors have come to CSS over the years, the syntax and structure have remained very much the same. Sass brings structure and reuse to the world of CSS. This talk will cover the basics of getting started with Sass.","Speaker":"Rob Peck","Tags":["Beginner","CSS"]},{"Title":"ScriptCS - New ways to use C#","Abstract":"Many of us use C# for developing web, mobile, and desktop apps. But ScriptCS allows us to use C# in a REPL and as a scripting language. The leads to many very useful tools. We will look at how you can use ScriptCS to leverage your C# skills in now and productive ways.","Speaker":"Eric Potter","Tags":["C#"]},{"Title":"SCRUMBAN?!?! - What is it and how can it help your team?","Abstract":"Scrum & Kanban are two different ways to implement Agile processes– but what do they really mean and how are they different?  This talk will compare and contrast the two methodologies, and provide ideal situations in which both can be used.  We’ll then discuss what happens when you combine the two methodologies – SCRUMBAN?!?!  We’ll discuss when it’s ideal to have a Scrum team utilizing Kanban tools, the benefits in doing so and how your team can be more productive in your Agile processes!\n ","Speaker":"Heather Tooill","Tags":["Beginner","Project Management","Methodology","Business Analysis","Agile"]},{"Title":"Secure Form Processing and Protection","Abstract":"XSS, NONCE, CSRF, WTF?! Form processing is something that's very basic and easy to do...wrong. There are tools and technologies you need to be using to prevent your forms from being abused and data falling into the wrong hands. We'll explore several of these technologies and how to implement them into your applications to keep your data safe.","Speaker":"Joe Ferguson","Tags":["Intermediate","Security","Form Processing"]},{"Title":"Stop Teaching Children Code!","Abstract":"In 2012, after five intensive years of dedicating myself to running CodeStock, I stepped down.  I surprised myself when I teared up on stage making the announcement.  I did not step down because of exhaustion or stress, but rather there was greater project I had to move on to - teaching children and working in STEM (Science Technology Engineering Math) education.  I had many ideas of how to help children with STEM.  Very few, if any, were correct.\n\nThis talk is covers the gap between the buzzwords and how children actually learn.  The problems faced in STEM education are not addressed by most STEM programs.  Working with children these past few years I have a better handle on the actual problems are and why code-focused programs fail to address them.  I hope to leave you with no just an understanding of these problems, but also with knowledge you can use in teaching STEM children whether you do it in a class room or at home with your family.","Speaker":"Michael C. Neel","Tags":["Soft Skills","STEM","Education"]},{"Title":"Telling your Story: Speaking for Non-Speakers","Abstract":"The idea of presenting at conferences is frequently daunting to non-speakers. When I got started giving talks, I was terrified of being called out on areas I wasn’t an expert in. I finally realized that there are different ways to present information.\n\nProscriptive talks – talks that present the one true way to solve a problem – are only one way to help people learn. Presenting about your experiences, by telling stories, helps the audience learn about what you’re talking about in an engaging way, and helps you to have the confidence that you are engaging in a conversation with the audience instead of a lecture.\n\nDo you enjoy talking about technical topics in smaller groups? If so, you’ve likely got some excellent tales to tell to help other people past hurdles you’ve jumped, or around mines you’ve learned to avoid.\n\nCome hear my stories about speaking, the lessons I’ve learned, and tricks I employ in order to engage and retain the attention of my audience. At the end I'll give a couple of short coding presentations to demonstrate how to use these strategies with technical talks.\n\nCome join the presenter community! We don’t bite, and we have cookies!","Speaker":"Kirsten Hunter","Tags":["Beginner","Soft Skills","Funny"]},{"Title":"Test for Security; Tests for Design","Abstract":"Many people come to the world of test driven development because of the security it provides.  However, when done correctly TDD provides loads of other benefits; specifically it can help us design better software.\n\nIn this talk we'll discuss tools and techniques to drive better designs with tests.  Specifically we'll talk about test isolation with mocks and stubs, test speed, designing apis, and more.  Everyone will leave with a better understanding of how to utilize TDD and BDD to create not just safer code, but better code.","Speaker":"Keathley","Tags":["Intermediate","Continuous Integration","Ruby","Behavior Driven Development","Design","TDD"]},{"Title":"The Renaissance of Functional Programming","Abstract":"In a field of continually recycled ideas, the old paradigm of functional programming is gaining popularity among software developers.  In this presentation we will review some of the catalytic trends that have reshaped the challenges of software development.  We then will discuss how functional programing is a fundamentally simpler paradigm well-suited for modern software development.  Managers and developers alike will leave understanding how and why to embrace functional programming to improve their software projects.","Speaker":"joescii","Tags":["Beginner","Functional Programming","Programming Paradigms"]},{"Title":"THIS AIN'T YOUR MOMMA'S HTML: CUSTOM COMPONENTS IN AURELIA","Abstract":"Custom Elements and Custom Attributes in Aurelia allow you to create your own HTML elements, all without the drudgery of dealing directly with Web Components. Join Ashley Grant (Core Team Member) as we explore how to work with them. You'll come to learn about how easy it is to create Aurelia Custom Elements and Attributes. You'll stay to see how just how powerful Custom Elements and Attributes can be. You'll leave basking in the glow of the awesomeness that is Aurelia Custom Elements and Attributes.","Speaker":"Ashley Grant","Tags":["Intermediate","Web","JavaScript","Aurelia"]},{"Title":"Three Virtues of a Programmer - How to make Laziness, Impatience, and Hubris Work for You.","Abstract":"Many would consider laziness, impatience, and hubris to be qualities that are better left checked at the door in a professional environment. Others consider them virtues and core components of the most efficient programmers and IT people. What is it that makes these qualities virtuous? How do they relate to each other? And how can we wield them in a way that helps us succeed? We will entertain how these qualities will help us become more productive, more useful, and more awesome in general.\n ","Speaker":"Nathan Kelley","Tags":["Soft Skills"]},{"Title":"Web Performance","Abstract":"With the use of mobile devices increasing, the speed at which your web site loads is becoming more and more important. Some web sites are found to load as much data as some MP3 files. It is not always about how much data you load as it can be about the methods used to load things. In this talk, there will be examples showing why performance matters as well as techniques for how to improve a web sites performance.","Speaker":"Brian Moon","Tags":["Intermediate","Web","Optimizing"]},{"Title":"Your Playbook","Abstract":"play·book - n. a stock of usual tactics or methods. We are builders, solvers, and thinkers -- wielders of logic over our domains. Yet we are opinionated, emotional, biased -- human. Regardless of where we are on our personal/career journey, it's helpful to make a playbook containing the goals, values, and processes that resonate with us as individuals. Such concepts transcend any technology, problem domain, or job and allow us to bend with the wind or stand firm against the storm. Our personal playbook gives us a touchstone to refer back to when we get lost, question, and doubt.\n\nIn this talk I share some pages from my playbook that have helped me grow and sustain my sense of self and my direction in my career. For example, when working on a difficult area in code, mob programming has been really effective on several levels. Seekers of silver bullets may be disappointed; however, I hope to spark some thought and inspiration by taking what I've learned to help you develop or expand your own playbook.","Speaker":"Geoff Mazeroff","Tags":["Soft Skills"]},{"Title":"Zero to Hero with PowerShell","Abstract":"There are two kinds of people in the SQL Server world. Those who are using PowerShell, and those that will be. In this session you'll learn how to become one of the \"cool kids\" using PowerShell. \n\nWe'll begin with a super fast paced introduction to PowerShell starting with a quick overview of the two environments you can use PowerShell in, command windows and the ISE (Integrated Scripting Environment). Next you'll learn about cmdlets, variables, functions, and logic flow. You'll then see how to use PowerShell to assist you in your development efforts. \n\nDon't be left behind, learn how to leverage the power of PowerShell! \n","Speaker":"Robert Cain","Tags":["PowerShell"]}]